import { Typography } from '@/ui-kit';
import { Breadcrumbs } from '@/components';

const PrivacyPolicy = () => {
  return (
    <>
      <Breadcrumbs breadcrumbs={[{ label: 'Політика конфіденційності', path: '/' }]} />
      <div>
        <Typography gutterBottom="xlg" component="h3">
          УГОДА ПРО ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ ТА КОНФІДЕНЦІЙНІСТЬ ІНФОРМАЦІЇ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          Ця Угода про захист персональних даних та конфіденційність інформації (далі – Угода)
          встановлює порядок отримання, збору, накопичення, зберігання, обробки, використання,
          забезпечення захисту даних та відомостей, які є персональними даними, комерційною
          таємницею або конфіденційною інформацією про Користувача, або визначену Користувачем як
          персональні/конфіденційні, або підпадають під відповідне визначення згідно з
          законодавством України (далі разом – Дані).
          <br />
          <br /> ЦЯ УГОДА НЕ СТВОРЮЄ ЖОДНИХ АГЕНТСЬКИХ, ПАРТНЕРСЬКИХ ТА ТРУДОВИХ ВІДНОСИН МІЖ
          СТОРОНАМИ, НЕ Є ДОГОВОРОМ КУПІВЛІ-ПРОДАЖУ. <br />
          <br />
          ВИКОРИСТОВУЮЧИ ВЕБ-САЙТ, КОРИСТУВАЧ ПІДТВЕРДЖУЄ, ЩО ОЗНАЙОМИВСЯ ТА ЗГОДЕН З УМОВАМИ ЦІЄЇ
          УГОДИ ТА З УМОВАМИ УГОДИ ПРО КОРИСТУВАННЯ САЙТОМ (УГОДОЮ КОРИСТУВАЧА), ЩО РОЗМІЩЕНІ НА
          ВЕБ-САЙТІ ЗА ПОСИЛАННЯМ https://carely.com.ua/userAgreement
          <br />
          ЯКЩО КОРИСТУВАЧ НЕ ПОГОДЖУЄТЕСЯ З УМОВАМИ ЦІЄЇ УГОДИ, З УМОВАМИ УГОДИ КОРИСТУВАЧА
          (ПОВНІСТЮ АБО ЧАСТКОВО), КОРИСТУВАЧЕВІ ЗАБОРОНЯЄТЬСЯ ВИКОРИСТОВУВАТИ ВЕБ-САЙТ. ПОДАЛЬШЕ
          ВИКОРИСТАННЯ ВЕБ-САЙТУ СВІДЧИТЬ ПРО ПОГОДЖЕННЯ ТА ПРИЄДНАННЯ КОРИСТУВАЧА ДО ЦІЄЇ УГОДИ
          ПОВНІСТЮ ТА ПІДТВЕРДЖУЄ ЙОГО ЗГОДУ З НАВЕДЕНИМИ НИЖЧЕ УМОВАМИ.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          1. ТЕРМІНИ ТА ВИЗНАЧЕННЯ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          1.1. Володілець персональних даних – це фізична або юридична особа, яка визначає мету
          обробки персональних даних, встановлює склад цих даних та процедури їх обробки, якщо інше
          не встановлено законодавством України. В розумінні цієї Угоди, Володільцем персональних
          даних є Адміністрація та/або Партнери.
          <br /> 1.2. База персональних даних – це іменована сукупність упорядкованих Персональних
          даних в електронній формі та/або у формі картотеки Персональних даних. Адміністрація є
          Володільцем своєї власної бази персональних даних «База персональних даних «Користувачі».
          <br />
          1.3. Веб-маяки – це графічні файли зображень, вбудовані до веб-сторінки, яка зазвичай
          використовується для моніторингу активності Користувачів на Веб-сайті, з метою підвищення
          якості послуг, що пропонуються на Веб-сайті. Адміністрація використовує ці Веб-маяки
          напряму або через постачальників послуг як частину онлайн реклами на Веб-сайті або на
          сайтах третіх сторін, щоб (і) дізнатися, чи здійснює бронювання Користувач, який побачив
          онлайн рекламу; (іі) відстежити конверсію на сайтах Партнерів; (ііі) проаналізувати
          особливості трафіку Користувача.
          <br />
          1.4. Веб-сайт – сукупність даних, електронної (цифрової) інформації, інших об’єктів
          авторського права  та /або суміжних прав тощо, пов’язаних між собою і структурованих у
          межах адреси веб-сайту  та /або облікового запису Адміністрації як власника веб-сайту,
          доступ до яких здійснюється через адресу мережі Інтернет. Веб-сайт включає вихідний код,
          текстове наповнення, зображення, дизайн, зовнішній (front-end) та внутрішній (back-end)
          функціонал, а також будь-які об’єкти авторського права, які утворюють інтернет-портал та
          забезпечують його функціонування під доменним ім’ям carely.com.ua, включно з його
          мобільними версіями, додатками та іншими програмами/програмним забезпеченням. Цільове
          призначення Веб-сайту  – функціонування  Веб-сайту Carely як цей термін визначено нижче;
          <br /> 1.5. Дані – це сукупність Конфіденційної інформації та Персональних даних
          Користувачів, які добровільно за Згодою користувача надаються Адміністрації та/або
          Партнерам, та/або Партнерам через Адміністрацію у процесі використання Веб-сайту шляхом
          реєстрації відповідним Користувачем на Веб-сайті, внаслідок заповнення форм оформлення
          замовлення Послуг або шляхом реєстрації на Веб-сайті через свій профіль у соціальних
          мережах. Авторизація Користувача здійснюється за його бажанням та не є обов’язковою.
          <br />  1.6. Згода користувача – будь-яке добровільне, конкретне, поінформоване та
          однозначне волевиявлення Користувача, здійснене шляхом оформлення бронювання або проявом
          чітких ствердних дій для підтвердження згоди (дозволу) на Опрацювання Адміністрацією своїх
          Даних та/або будь-якої іншої інформації, відповідно до визначеної мети їх Опрацювання.
          Згода користувача (суб’єкта персональних даних) надається шляхом натискання віртуальної
          кнопки «Погоджуюсь».
          <br />
           1.7. Інфо-блок – окремий розділ на Веб-сайті, призначений для оприлюднення наданої для
          поширення Партнерами Інформаційних матеріалів та будь-якої іншої інформації.
          <br />
          1.8. Інформаційні матеріали – це поширена Партнером та/або Адміністрацією на Веб-сайті
          інформація. Такою інформацією є Інформація про послуги, довідкова інформація про заклади
          охорони здоров’я та/або мережі залкадів охорони здоров’я, рекламні матеріали та будь-яка
          інша поширена інформація/зображення на Веб-сайті (новини, референтні матеріали, посилання,
          інструменти, програми, спонсорські матеріали, форуми, карти, інформація про послуги тощо).
          <br />
          1.9. Інформація про послуги – необхідна, доступна, правдива та своєчасна інформація про
          послуги, що забезпечує Користувачеві можливість його свідомого та обізнаного вибору, а
          саме: найменування послуги, графік роботи, умови надання послуг, ціна, спеціалісти тощо,
          яка надається Партнерами для її подальшого оприлюднення Виконавцем на Веб-сайті.
          <br />
          1.10. Конфіденційна інформація – інформація про фізичну особу, а також інформація, доступ
          до якої обмежено фізичною або юридичною особою, окрім суб’єктів владних повноважень.
          Конфіденційна інформація може поширюватися за бажанням (згодою) відповідної особи у
          визначеному нею порядку відповідно до передбачених нею умов, а також в інших випадках,
          визначених законодавством України.
          <br />
          1.11. Користувач – юридична або фізична особа, яка офіційно зареєстрована на Веб-сайті та
          має власний Обліковий запис користувача або особа, яка хоча б одного разу відвідала
          Веб-сайт. Користувач у процесі користування Веб-сайтом набуває статусу Суб’єкта
          персональних даних.
          <br />
          1.12. Веб-сайт Carely – обмін інформацією між Партнерами та Користувачами, який
          здійснюється за допомогою спеціалізованого Веб-сайту з окремими Інфо-блоками для надання
          інформаційних послуг. Метою створення та діяльності Веб-сайту Carely є надання
          Користувачеві можливості отримувати віддалений (через мережу Інтернет) доступ до
          Інформаційних матеріалів, віддалено (через мережу Інтернет) формувати електронне
          повідомлення про їх можливий намір придбання Послуг у Партнера.
          <br />
          1.13. Опрацювання – означає будь-яку операцію або низку операцій з персональною та/або
          неперсональною інформацією або наборами персональних даних з використанням автоматизованих
          засобів або без них, таких як: збирання, реєстрація, обробка, організація, структурування,
          зберігання, адаптація чи зміна, пошук, ознайомлення, використання, розкриття через
          передавання, розповсюдження чи надання іншим чином, упорядкування чи комбінування,
          обмеження, стирання чи знищення, що здійснюється Адміністрацією та/або Партнерами.
          <br />
          1.14. Обліковий запис користувача –  розділ Веб-сайту, в якому міститься реєстраційна
          інформація, що вноситься Користувачем на Веб-сайті. До цього розділу надходить
          конфіденційна інформація та персональні дані Користувача, внесенням яких Користувач надає
          згоду на їх отримання, оброблення, передачу та зберігання Адміністрацією та/або
          Партнерами.
          <br />
          1.15. Партнери – будь-які фізичні чи юридичні особи, пов’язані з Адміністрацією
          договірними відносинами, зокрема ліцензіати та всі інші особи, яким надається право
          обмеженого доступу до Веб-сайту через Інфо-блоки з метою поширення та надання інформації
          про послуги Партнерів (включно з Інформаційними матеріалами та повідомленнями,
          оприлюдненими від їхнього імені або в їхніх інтересах), а також отримання заявок на
          бронювання або замовлення Послуг від Користувачів.
          <br /> 1.16. Персональні дані – будь-яка інформація, що стосується фізичної особи, яку
          ідентифіковано чи можна ідентифікувати. Ідентифікація фізичної особи здійснюється прямо чи
          опосередковано, зокрема, за такими ідентифікаторами як: ім’я, електронна адреса, номер
          телефону, ідентифікаційний номер, дані про місцеперебування, онлайн-ідентифікатор, або за
          одним чи декількома факторами, що є визначальними для фізичної, фізіологічної, генетичної,
          розумової, економічної, культурної чи соціальної сутності такої фізичної особи.
          <br />
          1.17. Послуги – будь-які послуги, що надаються та продаються Партнерами для потреб
          Споживачів, інформація про які поширюється на Веб-сайті Carely;
          <br /> 1.18. Споживач – фізична особа, яка придбаває, замовляє, використовує або має намір
          придбати чи замовити Послугу за допомогою Веб-сайту для особистих потреб, безпосередньо не
          пов’язаних з підприємницькою діяльністю або виконанням обов’язків найманого працівника;
          <br />
          1.19. Cookie – фрагмент даних, згенерований Сайтом і збережений на комп’ютері (у браузері)
          Користувача у вигляді одного або декількох файлів.
          <br />
          <br /> Інші терміни використовуються у цій Угоді згідно з визначеннями, що містяться у
          законодавстві України.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          2. ВСТУПНА ЧАСТИНА
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          2.1. Ця Угода є договором приєднання відповідно до положень статті 634 Цивільного кодексу
          України. Використання Користувачем Веб-сайту у будь-який спосіб, свідчить про приєднання
          Користувача до цієї Угоди повністю і підтверджує факт надання Згоди користувача з
          наведеними в цій Угоді умовами.
          <br />
          2.2. У випадку схвалення/приєднання до цієї Угоди Користувач підтверджує, що цілком і
          повністю ознайомлений і згоден з її умовами, а також, у випадку якщо Користувач є фізичною
          особою, що він надає дозвіл на Опрацювання його Даних з метою та в порядку, передбаченими
           умовами цієї Угоди.
          <br />
          2.3. Якщо Користувач не погоджується дотримуватися умов цієї Угоди, КОРИСТУВАЧ
          ЗОБОВ’ЯЗАНИЙ НЕГАЙНО ПРИПИНИТИ БУДЬ-ЯКЕ ВИКОРИСТАННЯ ВЕБ-САЙТУ.
          <br />
          2.4. КОРИСТУВАЧ ВИЗНАЄ, ЩО АДМІНІСТРАЦІЯ МОЖЕ ЧАС ВІД ЧАСУ ЗМІНЮВАТИ, МОДИФІКУВАТИ,
          ДОПОВНЮВАТИ АБО ВИДАЛЯТИ ЧИ ІНШИМ ЧИНОМ ОНОВЛЮВАТИ ЦЮ УГОДУ НА СВІЙ РОЗСУД БЕЗ
          ПОВІДОМЛЕННЯ ПРО ЦЕ КОРИСТУВАЧА.
          <br />
          2.5. Веб-сайт містить широке коло функціональних можливостей для Користувачів, основними
          серед яких є отримання Інформаційних матеріалів, здійснення пошуку та бронювання Послуг в
          закладах охорони здоров’я (їх мережах) за електронними каталогами Партнерів, що
          поширюються на Веб-сайті та є доступним для Користувачів за допомогою Веб-сайту.
          <br />
          2.6. Якщо Користувач не погоджується з будь-якими змінами або прийняв рішення про відмову
          від Угоди користувача, від цієї Угоди або бажає, щоб його Дані були видалені, Користувач
          може видалити свій Обліковий запис користувача або звернутися до Адміністрації з
          відповідною заявою у порядку, визначеному розділом 9 цієї Угоди.
          <br />
          2.7. Відкликання Користувачем Згоди користувача не впливає на законність Опрацювання, що
          ґрунтувалося на Згоді користувача до такого відкликання.
          <br />
          2.8. Зазначена Угода є обов’язковою для застосування відповідальною особою, працівниками
          Адміністрації та Партнерами, які безпосередньо здійснюють Опрацювання та/або мають доступ
          до Даних у зв’язку з виконанням своїх обов’язків та/або договірних зобов’язань щодо
          дотримання конфіденційності отриманих від Адміністрації Даних.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          3. СФЕРА ДІЇ УГОДИ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          3.1. Ця Угода стосується Веб-сайту включно з його мобільними версіями, додатками та іншими
          програмами/програмними забезпеченнями, зокрема, проте не виключно: IOS, Android, та інші,
          системи збирання статистики відвідувань Веб-сайту (Google Analytics та ін.); соціальні
          плагіни (блоки) соціальних мереж (Facebook та ін.) тощо.
          <br /> 3.2. Адміністрація може передавати Дані, зібрані згідно з цією Угодою, Партнерам,
          між відповідними Веб-сайтами та Програмами, які належать Адміністрації або якими вона
          керує, проте Дані, зібрані відповідно до Угоди користувача та цієї Угоди, завжди захищені
          відповідно до положень цієї Угоди та законодавства України. Водночас Партнери несуть
          самостійну відповідальність за дотримання законодавчих вимог Обробки та/або Опрацювання
          та/або використання Даних.
          <br />
           3.3. Користувач підтверджує, що він повністю розуміє цільове призначення Веб-сайту та
          цільове призначення Опрацювання його Даних. Отримуючи Інформацію про послуги, Користувач
          надає згоду на отримання дистанційного доступу до інформації про послуги. Відповідальним
          за зміст наданої для розміщення Інформації про послуги є Партнер.
          <br /> 3.4. Обробка та/або Опрацювання та/або використання Даних може здійснюватися
          Адміністрацією та/або Партнерами з метою: (і) виконання договірних зобов’язань; (іі)
           обробки платежів, проведення розрахункових операцій, надання звітності, ведення
          бухгалтерського та управлінського обліку (якщо такі здійснюються); (ііі) надання або
          пропонування Адміністрацією або Партнерами товарів або послуг Користувачеві; (iv)
          створення та реалізації бонусних програм, акцій, розіграшів тощо (якщо такі проводяться);
          (v) надсилання Користувачеві комерційних пропозицій та будь-якої інформації поштою,
          електронною поштою, телефоном, через мобільні додатки та соціальні мережі, що дозволяють
          здійснювати дзвінки та відправляти текстові повідомлення; (vi) надання дистанційного
          доступу до Інформаційних матеріалів, реклами та інших відомостей; (vii) надання
          онлайн-сервісів (послуг) Веб-сайту; (viii) розміщення відомостей (інформації, даних,
          відгуків, коментарів тощо) Користувача на Веб-сайті; (ix) формування Бази персональних
          даних; (x) покращення/спрощення роботи з Веб-сайтом. 
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          4. ПРАВА ТА ОБОВ’ЯЗКИ КОРИСТУВАЧА
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          4.1. Права Користувача:
          <br /> 4.1.1 Користувач має право в будь-який час заперечити проти Опрацювання його Даних.
          Адміністрація припинить обробку Даних після того, як заперечення буде подано у формі
          відповідної заяви у порядку, визначеному розділом 9 цієї Угоди. Опрацювання Даних буде
          припинено з моменту фактичного отримання заперечення Адміністрацією.
          <br /> 4.1.2 Користувач у будь-який час може відкликати Згоду користувача шляхом подання
          на ім’я Адміністрації відповідної заяви в порядку, визначеному розділом 9 цієї Угоди.
          Заява з відкликанням Згоди користувача набуває чинності з дати її фактичного отримання
          Адміністрацією.
          <br />
          4.1.3  Користувач має право вимагати від Адміністрації негайного виправлення будь-яких
          Даних, що його стосуються, якщо ці Дані не відповідають дійсності, або самостійно їх
          виправити через особистий кабінет Користувача. З огляду на мету Опрацювання Користувач має
          право доповнити свої Дані, зокрема, шляхом подачі відповідної заяви у порядку, визначеному
          розділом 9 цієї Угоди.
          <br />
          4.1.4  Користувач має право на видалення його Даних. Адміністрація видаляє Дані без
          невиправданої затримки, за наявності хоча б однієї з таких підстав: (а) Дані більше не
          потрібні для цілей, для яких вони були зібрані або іншим чином Опрацьовані; (б) Користувач
          відкликає свою Згоду користувача; (в) Користувач подає заперечення проти Опрацювання його
          Даних; (г) Дані Опрацьовувалися незаконно; (д) Дані повинні бути видалені для виконання
          юридичного зобов’язання згідно з застосовним законодавством України.
          <br /> 4.1.5 Користувач має право на отримання своїх Даних, які він надав Адміністрації та
          має право на передання таких Даних третім особам (зокрема, іншим володільцям та
          розпорядникам персональних даних) без перешкод зі сторони Адміністрації.
          <br /> 4.1.6 Користувач має право вимагати будь-яку інформацію про його Дані, оброблені
          Адміністрацією. Користувач має право подавати скарги до компетентних органів.
          <br />
          4.2. Обов’язки Користувача:
          <br /> 4.2.1 Користувач має право використовувати Веб-сайт виключно в межах тих прав і
          тими способами, які встановлені цією Угодою та Угодою користувача.
          <br />
          4.2.2 Використання Облікового запису користувача на Веб-сайті може здійснюватися виключно
          та особисто Користувачем. Одна фізична особа –  Користувач - може мати лише один Обліковий
          запис користувача.
          <br />
          4.2.3 Користувач зобов’язується надавати Адміністрації лише достовірні Дані та повідомляти
          Адміністрацію про їх зміну.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          5. ДАНІ, ЯКІ ОПРАЦЬОВУЮТЬСЯ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          5.1. Адміністрація та/або Партнери здійснюють Опрацювання таких Даних Користувача:
          <br />
          5.1.1 Персональні (особисті) дані, тобто інформація, яка може бути використана для
          ідентифікації Користувача, та/або
          <br />
          5.1.2. дані, що надаються Користувачем як при заповненні реєстраційних форм на Веб-сайті,
          так і в процесі користування Веб-сайтом (файли Cookie; IP-адреси; параметри і налаштування
          інтернет -браузерів тощо), та/або
          <br /> 5.1.3 неперсональні (неособисті) дані, тобто інформація, яка не використовується
          для ідентифікації Користувача, та/або
          <br /> 5.1.4 конфіденційна інформація.
          <br /> 5.2. Під час процедури реєстрації з метою отримання доступу до Облікового запису
          користувача, Користувач надає Адміністрації необхідні Дані, зокрема, проте не виключно:
          електронну адресу та/або номер телефону, логін і пароль або інші доступні дані, отримані у
          разі авторизації за допомогою соціальних мереж. Дані можуть бути оновлені та доповнені
          Користувачем за допомогою параметрів Облікового запису користувача. Користувач не
          зобов’язаний розміщувати або завантажувати будь-які Дані та/або відомості, втім їх
          відсутність може завадити ефективній взаємодії між Користувачем та
          Адміністрацією/Партнерами/третіми особами.
          <br /> 5.3. Шляхом надання або розміщення будь-яких Даних, а також вчинення інших дій в
          Обліковому записі користувача Користувач надає Згоду Користувача на Опрацювання цих Даних
          у розумінні та порядку, визначеному цією Угодою та чинним законодавством України.
          <br />
          5.4. Незважаючи на те, що Адміністрація може час від часу контролювати або перевіряти
          обговорення, чати, відгуки, пости та повідомлення, які поширюються на Веб-сайті,
          Адміністрація не бере на себе жодних зобов’язань та не несе відповідальності (і) за зміст
          будь-яких повідомлень/ відгуків; (іі) за будь-яку помилку, наклеп, дифамацію, упущення,
          фальсифікацію, рекламні матеріали, непристойності, лихослів’я, розкриття
          приватної/конфіденційної/комерційної інформації або (ііі) за неточності, недостовірні або
          не актуалізовані відомості (наприклад, щодо Інформаційних матеріалів, що поширені
          Партнерами за допомогою Веб-сайту); (іv) за порушення законодавства України, здійсненні в
          процесі Опрацювання та створення Баз даних, володільцями яких є треті особи/Партнери,
          тощо.
          <br />
          5.5. Користувачеві заборонено розміщувати або передавати будь-які незаконні, рекламні,
          загрозливі, наклепницькі, дифамаційні, непристойні, скандальні, підбурливі, порнографічні
          або образливі матеріали чи інші матеріали, які можуть становити або стимулювати поведінку,
          що може розглядатися як порушення законодавства України, честі, гідності та ділової
          репутації інших осіб
          <br />
          .5.6. Користувачі та Партнери несуть особисту відповідальність за будь-які Інформаційні
          матеріали та інформацію, які розміщують на Веб-сайті, повідомляють іншим Користувачам, а
          також за будь-яку взаємодію з іншими Користувачами, яка повинна здійснюватися на їхній
          власний ризик. Адміністрація НЕ НЕСЕ ВІДПОВІДАЛЬНОСТІ за завдану шкоду або понесені
          збитки, яких зазнав Користувач або треті особи в результаті помилкового розуміння або
          нерозуміння умов цієї Угоди, Угоди користувача та інших технічних питань.
          <br /> 5.7. Під час публікації Користувачем будь-яких коментарів на Веб-сайті чи його
          форумі, за замовчуванням такий коментар відображатиметься під ім’ям Користувача.
          Користувач самостійно регулює та завантажує додаткову інформацію для відображення її на
          Веб-сайті. Інформація, яка публікується Користувачем на Веб-сайті та/або форумі, є
          загальнодоступною інформацією, і може бути використана Адміністрацією, Партнерами та
          третіми особами.
          <br /> 5.8. Під час використання Веб-сайту, Користувачам можуть бути продемонстровані
          рекламні, спонсорські та інші інформаційні матеріали. На Веб-сайті можливе проведення
          опитувань від імені Адміністрації/Партнерів чи третіх осіб та здійснення оцінки
          ефективності реклами чи інших інформаційних матеріалів з метою зведення Статистики.
          <br /> 5.9. Адміністрація збирає не персональну (не особисту) інформацію про використання
          Користувачем Веб-сайту та додатків, за допомогою файлів Сookie та Веб-маяків, які
          використовуються для: (і) відстеження використання контенту з Веб-сайту; (іі) допомоги
          Адміністрації у наданні Користувачам  таргетованої реклами; (ііі) аналізу  Послуг, що
          пропонуються Користувачам; (iv) відстеження статистики перегляду електронних листів
          Адміністрації та Партнерів.
          <br />
          5.10. Опрацювання Персональних даних про расове або етнічне походження, політичні,
          релігійні або світоглядні переконання, членство в політичних партіях та професійних
          спілках, а також даних, що стосуються здоров’я чи статевого життя (особливі категорії
          даних) забороняється.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          6. ВИМОГИ ДО ДАНИХ, ЯКІ НАДАЄ КОРИСТУВАЧ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          6.1. Під час використання цього Веб-сайту Користувач погоджується надавати лише достовірні
          Дані та підтримувати їх в актуальному стані.
          <br />
          6.2. У випадку надання Користувачем недостовірних Даних або порушення Користувачем умов
          цієї Угоди або Угоди користувача, Адміністрація залишає за собою право призупинити або
          припинити надання Користувачеві послуг доступу до Веб-сайту.
          <br />
          6.3. За винятком Персональних даних, перелік яких визначено цією Угодою та чинним
          законодавством України, всі інші повідомлення та матеріали, що передаються Користувачем
          через Веб-сайт електронною поштою або іншим чином, не є персональними, конфіденційними або
          службовими і не будуть сприйматися як такі.
          <br />
          6.4. Ця Угода не поширюється на інформацію про компанію, ідеї, концепції, запити,
          замовлення, які Користувач надсилає Адміністрації або її Партнерам електронною поштою або
          іншими повідомленнями, не використовуючи при цьому Веб-сайт.
          <br />
          6.5. Адміністрація може збирати додаткову інформацію про Користувачів зі сторонніх
          інформаційних джерел, з метою вдосконалення послуг та Інформаційних матеріалів Веб-сайту.
          <br />
          6.6. Діяльність Веб-сайту постійно удосконалюється. Адміністрація часто реалізує нові
          функції, для яких може знадобитися збір Даних. Якщо Адміністрація почне збирати принципово
          інші Дані або істотно змінить способи Опрацювання даних, про це буде повідомлено
          Користувачів шляхом внесення змін до поточної редакції цієї Угоди та Угоди користувача.
          <br />
          6.8. Користувач не повинен публікувати та/або вказувати в Обліковому записі користувача
          Дані, які він вважає призначеними для обмеженого кола осіб.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          7. НЕРОЗГОЛОШЕННЯ ДАНИХ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          7.1. Адміністрація не продаватиме, ділитиметься або іншим чином поширюватиме Дані третім
          особам, крім випадків, передбачених у цій Угоді. Дані можуть бути передані Адміністрацією
          третім особам без додаткового повідомлення Користувача про таку передачу Даних (наприклад,
          Дані можуть бути передані Партнерам), для здійснення подальшого Опрацювання виключно з
          метою, для якої Дані збиралися. Розкриття Даних Партнерам відбувається під час
          замовлення/бронювання Користувачем Послуг на Веб-сайті, проте виключно в обсязі,
          необхідному для ідентифікації Користувача та його замовлення.
          <br />
          7.2. Дані, отримані від Користувача, також можуть бути передані третій особі, без
          додаткового повідомлення Користувача про таку передачу, наскільки це дозволено чинним
          законодавством України, в тому випадку, якщо Веб-сайт або його частина буде відчужена,
          будь-яким чином передана (наприклад, шляхом надання повного чи обмеженого доступу до
          Інфо-блоків чи інших частин Веб-сайту) третім особам у порядку, визначеному чинним
          законодавством України. У цьому випадку, з моменту такого відчуження/передання/надання
          доступу тощо, права та обов’язки, визначені цією Угодою, переходять до правонаступників на
          підставі відповідного договору. Крім того, Дані можуть бути передані третій особі без
          додаткового повідомлення Користувача про таку передачу відповідно до вимог чинного
          законодавства України, рішення суду або акта суб’єкта владних повноважень.
          <br />
          7.3. Адміністрація намагатиметься повідомляти Користувачів про належно заявлені вимоги про
          розкриття їх Даних. Адміністрація може оскаржити такі вимоги, якщо вважатиме, що отримані
          запити надмірно широкі, незрозумілі або зроблені з порушенням повноважень відповідного
          надавача. Проте Адміністрація не бере на себе зобов’язання щодо такого оскарження.
          <br />
          7.4. Доступ до Персональних даних не надаватиметься третім особам, які відмовляються або
          неспроможні взяти на себе зобов’язання щодо забезпечення виконання вимог законодавства
          України у сфері захисту Персональних даних. Відмова у доступі до персональних даних також
          допускається, якщо доступ до них заборонено згідно із законодавством України.
          <br />
          7.5. Ця Угода не регулює та Адміністрація не несе відповідальності за Опрацювання та
          розкриття Персональних даних і будь-якої іншої інформації третім особам, які не
          перебувають у володінні або під керуванням Адміністрації, фізичними особами, які не є
          працівниками Адміністрації та Партнерами, навіть якщо Користувач отримав доступ до їх
          сайтів, рекламних матеріалів, Інформації про послуги, за допомогою Веб-сайту.
          Адміністрація не несе відповідальності за контент сайтів, посилання на які вказані на
          Веб-сайті.
          <br />
          7.6. Достатнім повідомленням Користувача про внесення його Персональних даних до Бази
          даних Користувачів та здійснення Опрацювання його Персональних даних, буде надання Згоди
          користувача.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          8. БЕЗПЕКА ДАНИХ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          8.1. Адміністрація як Володілець Бази персональних даних обладнана системними і
          програмно-технічними засобами та засобами зв’язку, які запобігають втратам, крадіжкам,
          несанкціонованому знищенню, викривленню, підробленню, копіюванню інформації і відповідають
          вимогам міжнародних та національних стандартів. Відповідальна особа організовує роботу,
          пов’язану із захистом персональних даних при їх обробці, відповідно до закону. Під час
          роботи з Даними Адміністрація вживає заходів, розроблених для захисту інформації від
          втрати, неправомірного використання, несанкціонованого доступу, розголошення, зміни або
          знищення.
          <br />
          8.2. Відповідальна особа призначається наказом Адміністрації.
          <br />
          8.3. Адміністрація використовує методи захисту Даних з метою визначення зареєстрованих
          <br />
          Користувачів. Надійна перевірка ідентичності Користувача називається автентифікацією.
          Адміністрація використовує логін і пароль Користувачів для їх автентифікації.
          <br />
          8.4. Сторони розуміють, що мережа Інтернет не має централізованого управління, правил
          використання чи доступу, та електронні повідомлення можуть бути спотворені, не завжди
          оперативно доставлені (або зовсім не доставлені), і що інші способи комунікації можуть
          бути надійнішими. Окрім того, існує вірогідність зараження електронної інформації
          вірусами, які існують в Інтернеті. Адміністрація не може підтвердити або гарантувати, що
          будь-які із завантажених файлів із Веб-сайту або з будь-якого іншого веб-сайту не містять
          помилок, вірусів або інших шкідливих програм. Користуючись Веб-сайтом, Користувач
          погоджується взяти на себе ризики, з якими пов’язане завантаження файлів і використання
          інформації. Також Користувач підтверджує, що він був сповіщений про те, яких заходів слід
          вжити для захисту його комп’ютера та файлів від видалення, пошкодження та інших помилок.
          Якщо у Користувача виникнуть будь-які запитання щодо заходів захисту його комп’ютера,
          Користувач може звернутися до служби підтримки Користувачів за електронною
          carely.ua@gmail.com.
          <br />
          8.5. Користувач визнає, що, в разі нехтування Користувачем безпекою і захистом Даних,
          треті особи можуть отримати до них несанкціонований доступ. Адміністрація не несе
          відповідальності за збитки, завдані таким доступом.
          <br />
          8.6. Працівники, які безпосередньо здійснюють Опрацювання та/або мають доступ до
          Персональних даних у зв’язку з виконанням своїх службових (трудових) обов’язків,
          зобов’язані дотримуватися вимог законодавства України в сфері захисту Персональних даних
          та внутрішніх документів Адміністрації щодо обробки і захисту Персональних даних у Базах
          персональних даних. Працівники, які мають доступ до Персональних даних, зокрема,
          здійснюють їх Опрацювання, зобов’язані не допускати розголошення у будь-який спосіб
          Персональних даних, які їм було довірено або які стали їм відомі у зв’язку з виконанням
          професійних чи службових або трудових обов’язків. Таке зобов’язання чинне після припинення
          ними діяльності, пов’язаної з Персональними даними, крім випадків, установлених
          законодавством України.
          <br />
          8.7. Особи, які мають доступ до Персональних даних, зокрема, здійснюють їх обробку, у
          випадку порушення ними вимог Закону України «Про захист персональних даних» несуть
          відповідальність згідно з законодавством України. 8.8. Адміністрація на постійній основі
          здійснює контроль за вжитими заходами щодо забезпечення безпеки Даних.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          9. ПОРЯДОК ЗБОРУ, ОБРОБКИ, ЗБЕРІГАННЯ, ПРАВО ДОСТУПУ, ВНЕСЕННЯ ЗМІН І ЗАПЕРЕЧЕНЬ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          9.1. Шляхом реєстрації або використання Веб-сайту Користувач погоджується отримувати
          повідомлення від Адміністрації/Партнерів/третіх осіб. Адміністрація та Партнери можуть
          використовувати реєстраційну інформацію Користувача, щоб надсилати йому повідомлення з
          Інформацією про Послуги. Інші способи використання Даних залежать від побажань Користувача
          і того, як він використовує Веб-сайт.
          <br />
          9.2. Інформація, яку передає або розміщує Користувач, може бути використана, зокрема,
          проте не виключно, з метою Опрацювання, відтворення, розкриття, передачі, публікації,
          трансляції та розміщення в мережі Інтернет.
          <br />
          9.3. Адміністрація використовує Дані з метою забезпечення безпеки, запобігання шахрайства
          та проведення розслідувань. Адміністрація використовує Дані (зокрема, повідомлення) для
          забезпечення безпеки або розслідування потенційного шахрайства/інших порушень Угоди
          Користувача або цієї Угоди та/або спроб завдати шкоди Користувачам та Партнерам Веб-сайту.
          <br />
          9.4. Обробка персональних даних здійснюється повністю або частково в електронній формі з
          використанням засобів інформаційної (автоматизованої) системи.
          <br />
          9.5. Користувач має можливість здійснювати управління файлами Сookie, відмовитися від
          збору Cookie в налаштуваннях браузера, а також за допомогою інших засобів. Якщо Користувач
          вирішить відхилити файли Cookie, його можливості доступу та використання Веб-сайту можуть
          бути обмежені.
          <br />
          9.6. Строк зберігання Даних необмежений, якщо інше не передбачено окремо цією Угодою або
          чинним законодавством України. Опрацювання Даних здійснюється у дата-центрах, де
          розміщується обладнання, що забезпечує функціонування Веб-сайту. Опрацювання Даних
          здійснюється на обладнанні, яке знаходиться у приміщеннях з обмеженим доступом.
          <br />
          9.7. У процесі Опрацювання Даних, Адміністрація вживає усіх заходів, щоб забезпечити
          точність і актуальність Даних для тих цілей, для яких вони були зібрані. Адміністрація
          надає Користувачеві можливість відкликати свою Згоду користувача, заперечити проти
          Опрацювання або реалізувати інші права, надані йому цією Угодою та чинним законодавством
          України.
          <br />
          9.8. Якщо Користувач виявить бажання зв’язатися з Адміністрацією з питань використання,
          видалення чи уточнення його Даних або заперечення проти Опрацювання його Даних, він
          повинен надіслати лист (і) на електронну пошту Адміністрації, визначену в пункті 9.10 цієї
          Угоди або (іі) на адресу Адміністрації за її місцезнаходженням (разом далі – Заява). У
          Заяві Користувач повинен обов’язково вказати, яку саме інформацію він просить виправити,
          оновити або видалити.
          <br />
          9.9. Строк розгляду Заяви щодо його задоволення не може перевищувати десяти робочих днів з
          дня його надходження. Протягом цього строку Адміністрація повідомляє Користувачеві, що
          Заяву буде задоволено або у задоволені Заяви відмовлено із зазначенням обґрунтованої
          підстави, визначеної у відповідному нормативно-правовому акті. Строк задоволення Заяви не
          може перевищувати тридцяти календарних днів з дня її надходження, якщо інше не передбачено
          законодавством України.
          <br />
          9.10. Якщо у Користувача виникнуть будь-які запитання або скарги щодо дотримання цієї
          Угоди або Угоди Користувача, або Користувач хоче надати будь-які рекомендації чи
          коментарі, щоб поліпшити якість роботи Веб-сайту, Користувач повинен звернутися до служби
          підтримки Користувачів за електронною поштою: carely.ua@gmail.com
          <br />
          9.11. Всі Бази персональних даних, які належать Адміністрації, знаходяться в дата-центрах
          або за адресою Адміністрації.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          10. ДОСТУП ДО ДАНИХ ТА ПРАВО ВИБОРУ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          10.1. Користувач може будь-коли оновлювати свою реєстраційну інформацію через функцію
          керування обліковими записами, доступними на Веб-сайті.
          <br /> 10.2. Якщо Користувач більше не бажає отримувати певний тип електронного
          повідомлення від Адміністрації або Партнерів та пов’язаних з ними ресурсів, він завжди
          може скасувати підписку, натиснувши на віртуальну кнопку відповідного посилання.
          <br /> 10.3. Інформаційні матеріали, доступні на Веб-сайті, призначені виключно для осіб,
          які досягли 18 років.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          11. ЧИННІСТЬ УГОДИ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          11.1. Якщо з тих чи інших причин одне або декілька положень цієї Угоди буде визнано
          нечинними або таким, що не має юридичної сили, це не впливатиме на чинність інших положень
          цієї Угоди. Будь-які відносини, що не врегульовані цією Угодою, регулюються відповідно до
          Угоди Користувача та чинного законодавства України.
        </Typography>
      </div>
    </>
  );
};

export default PrivacyPolicy;
