import { Typography } from '@/ui-kit';
import { Breadcrumbs } from '@/components';

const UserAgreement = () => {
  return (
    <>
      <Breadcrumbs breadcrumbs={[{ label: 'Угода користувача', path: '/' }]} />
      <div>
        <Typography gutterBottom="xlg" component="h3">
          УМОВИ КОРИСТУВАННЯ САЙТОМ (УГОДА КОРИСТУВАЧА)
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          Ці Умови користування сайтом (Угода користувача) (далі –  Угода) визначає спосіб, умови та
          правила використання Веб-сайту: https://carely.com.ua (далі – Веб-сайт), укладається між
          Користувачем, як цей термін визначено нижче, та Товариством з обмеженою відповідальністю
          «КЕРЕЛІ» код ЄДРПОУ 45314181(далі –  Адміністрація). <br />
          <br /> ТОВ «КЕРЕЛІ» НЕ Є ЗАКЛАДОМ ОХОРОНИ ЗДОРОВ’Я ТА НЕ ЗДІЙСНЮЄ ПРОВАДЖЕННЯ
          ГОСПОДАРСЬКОЇ ДІЯЛЬНОСТІ З МЕДИЧНОЇ ПРАКТИКИ. <br /> АДМІНІСТРАЦІЯ НАДАЄ ІНФОРМАЦІЮ ПРО
          ПОСЛУГИ, ЩО НАДАЮТЬСЯ ПАРТНЕРАМИ, З МОЖЛИВІСТЮ БЕЗКОШТОВНОГО ЇХ БРОНЮВАННЯ КОРИСТУВАЧАМИ.
          <br /> МЕТОЮ СТВОРЕННЯ ТА ДІЯЛЬНОСТІ ВЕБ-САЙТУ Є НАДАННЯ КОРИСТУВАЧЕВІ МОЖЛИВОСТІ
          ОТРИМУВАТИ ВІДДАЛЕНИЙ (ЧЕРЕЗ МЕРЕЖУ ІНТЕРНЕТ) ДОСТУП ДО ІНФОРМАЦІЙНИХ МАТЕРІАЛІВ,
          ВІДДАЛЕНО (ЧЕРЕЗ МЕРЕЖУ ІНТЕРНЕТ) ФОРМУВАТИ ЗАПИТ/БРОНЮВАННЯ. <br /> ПРИДБАННЯ ТА ОПЛАТА,
          ЗАБРОНЬОВАНИХ КОРИСТУВАЧАМИ ЧЕРЕЗ ВЕБ-САЙТ ПОСЛУГ, ПРОВОДИТЬСЯ БЕЗПОСЕРЕДНЬО В ЗАКЛАДІ
          ОХОРОНИ ЗДОРОВ’Я. <br /> ЦЯ УГОДА НЕ СТВОРЮЄ ЖОДНИХ АГЕНТСЬКИХ, ПАРТНЕРСЬКИХ ТА ТРУДОВИХ
          ВІДНОСИН МІЖ СТОРОНАМИ, НЕ Є ДОГОВОРОМ КУПІВЛІ-ПРОДАЖУ. <br /> <br /> ВИКОРИСТОВУЮЧИ
          ВЕБ-САЙТ, КОРИСТУВАЧ ПІДТВЕРДЖУЄ, ЩО ОЗНАЙОМИВСЯ ТА ЗГОДЕН З УМОВАМИ ЦІЄЇ УГОДИ ТА З
          УМОВАМИ УГОДИ ПРО ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ ТА КОНФІДЕНЦІЙНІСТЬ ІНФОРМАЦІЇ, ЩО РОЗМІЩЕНІ
          НА ВЕБ-САЙТІ ЗА ПОСИЛАННЯМ https://carely.com.ua/privacyPolicy <br />
          <br />
          ЯКЩО КОРИСТУВАЧ НЕ ПОГОДЖУЄТЕСЯ З УМОВАМИ ЦІЄЇ УГОДИ, З УМОВАМИ УГОДИ ПРО ЗАХИСТ
          ПЕРСОНАЛЬНИХ ДАНИХ ТА КОНФІДЕНЦІЙНІСТЬ ІНФОРМАЦІЇ (ПОВНІСТЮ АБО ЧАСТКОВО), КОРИСТУВАЧЕВІ
          ЗАБОРОНЯЄТЬСЯ ВИКОРИСТОВУВАТИ ВЕБ-САЙТ.ПОДАЛЬШЕ ВИКОРИСТАННЯ ВЕБ-САЙТУ СВІДЧИТЬ ПРО
          ПОГОДЖЕННЯ ТА ПРИЄДНАННЯ КОРИСТУВАЧА ДО ЦІЄЇ УГОДИ ПОВНІСТЮ ТА ПІДТВЕРДЖУЄ ЙОГО ЗГОДУ З
          НАВЕДЕНИМИ НИЖЧЕ УМОВАМИ.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          ВИЗНАЧЕННЯ ТЕРМІНІВ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          1.1. Адміністрація – власник Веб-сайту, Товариство з обмеженою відповідальністю «КЕРЕЛІ»,
          код ЄДРПОУ 45314181. <br /> 1.2. Використання веб-сайту – дозволене цією Угодою
          використання Веб-сайту за призначенням, зокрема, завантаження сторінок Веб-сайту,
          використання його ресурсів та сервісів, отримання Послуг у порядку, визначеному цією
          Угодою, Угодою про захист персональних даних та конфіденційність інформації та ін. <br />{' '}
          1.3. Веб-сайт/Веб-ресурс/ Веб-сайт Carely/Carely – сукупність розміщених у мережі Інтернет
          веб-сторінок, об’єднаних єдиною темою, дизайном та єдиним адресним простором домену
          https://carely.com.ua, включно з його мобільними версіями, додатками та іншими
          програмами/програмним забезпеченням, що містять інформацію, яка створена, зібрана або
          оброблена Адміністрацією, Партнерами чи міститься в інформаційній системі, що забезпечує
          доступність такої інформації в мережі Інтернет за мережевою адресою: https://carely.com.ua
          Метою створення та діяльності Веб-сайту є надання Користувачеві можливості отримувати
          віддалений (через мережу Інтернет) доступ до Інформаційних матеріалів, віддалено (через
          мережу Інтернет) формувати Запит (як цей термін визначено Договором); <br /> 1.4.
          Відвідувач/Користувач/Споживач – дієздатна фізична особа, яка досягла 18 років, пройшла
          процедуру авторизації на Веб-сайті та має власний Обліковий запис користувача або особа,
          яка хоча б одного разу відвідала Веб-сайт або особа, яка хоча б одного разу сформувала
          Запит. Споживач у процесі користування Веб-сайтом
          <br />
          набуває статусу Суб’єкта персональних даних та Користувача Веб-сайтом Carely;
          1.5. Дані –  це сукупність Конфіденційної інформації та Персональних даних користувача,
          даних авторизації, які свідомо надаються Адміністрації та/або Партнерам Користувачем, при
          використанні Веб-сайту шляхом реєстрації відповідним Користувачем на Веб-сайті, внаслідок
          заповнення форм, надання особистого номеру мобільного телефону, шляхом реєстрації на
          Веб-сайті через свій профіль у соціальних мережах та ін.
          <br /> 1.6. Інформаційні повідомлення –  інформація в електронній формі, що не суперечить
          чинному законодавству України, призначена для використання комплексів інформаційної
          мережі Веб-сайту з метою інформування Користувачів Веб-сайту.
          <br /> 1.7. Інформаційні матеріали – це інформація, поширена Партнером та/або
          Адміністрацією на Веб-сайті. Такою Інформацією є Інформація про Послуги, рекламні
          матеріали та будь-яка інша інформація, поширена на Веб-сайті.
          <br /> 1.8. Інформація про Послуги – необхідна, доступна, правдива та своєчасна інформація
          про послуги, що забезпечує Користувачеві можливість його свідомого та обізнаного вибору, а
          саме: найменування послуги, графік роботи, умови надання послуг, ціна, спеціалісти тощо,
          яка надається Партнерами для її подальшого оприлюднення Адміністрацією на Веб-сайті;
          <br /> 1.9. Обліковий запис Користувача –  розділ Веб-сайту, в якому містяться Дані, що за
          бажанням вносяться Користувачем через особистий кабінет Користувача на Веб-сайті, якщо
          такий створюється.
          <br />
          1.10. Опрацювання – означає будь-яку операцію або низку операцій з персональною та/або
          неперсональною інформацією або наборами персональних даних з використанням автоматизованих
          засобів або без них, таких як збирання, реєстрація, обробка,  організація, структурування,
          зберігання, адаптація чи зміна, пошук, ознайомлення, використання, розкриття через
          передавання, розповсюдження чи надання іншим чином, упорядкування чи комбінування,
          обмеження, стирання чи знищення.
          <br />
          1.11. Партнери –  будь-які фізичні чи юридичні особи, пов’язані з Адміністрацією
          договірними відносинами, які передають Адміністрації Інформацію про Послуги з метою їх
          поширення на Веб-сайті, а також отримують Запит, сформований за допомогою Програмного
          комплексу Carely про можливий намір Користувача у придбанні Послуг у Партнера з
          зазначенням послуги, спеціаліста, ціни, кількості;
          <br /> 1.12. Персональні дані – це відомості чи сукупність відомостей про фізичну особу,
          яка ідентифікована або може бути конкретно ідентифікована. <br />
          1.13. Веб-сайт Carely – обмін інформацією між Партнерами та Користувачами, який
          здійснюється за допомогою спеціалізованого Веб-сайту для надання інформаційних послуг.
          Метою створення та діяльності Веб-сайту Carely є надання Користувачеві можливості
          отримувати віддалений (через мережу Інтернет) доступ до Інформаційних матеріалів,
          віддалено (через мережу Інтернет) формувати Запит /електронне повідомлення про можливий
          намір Користувача у придбанні Послуг у Партнера. Під час запиту Користувача на Веб-сайті
          проходить пошук абсолютних співпадінь інформаційного запиту Користувача та поширеної на
          Веб-сайті інформації, наданої Партнерами. У разі, якщо інформація не відповідає запиту
          Користувача – інформація не відображається;
          <br /> 1.14. Послуги – будь-які послуги, що надаються та продаються Партнерами для потреб
          Споживачів, інформація про які поширюється на Веб-сайті Carely; є комплексом дій
          (консультаційних, лікувально-діагностичних чи інших), що надаються Партнерами або його
          працівниками в інтересах Користувача з метою профілактики, діагностики та лікування
          захворювань відповідно до законодавства України. Перелік медичних та інших супутніх до них
          послуг, їхня вартість, Інформаційні матеріали викладені на https://carely.com.ua та
          безпосередньо у місці провадження діяльності Партнера. Назва послуги та спеціаліст з її
          надання обираються Користувачем самостійно при створенні Запиту із запропонованих на
          веб-ресурсі варіантів. Партнер не зобов’язаний надавати будь-які інші Послуги, окрім тих,
          що були вказані при створенні Запиту Користувачем.
          <br /> 1.15. Запит – електронне повідомлення сформоване за допомогою Програмного комплексу
          Carely на підставі отриманої інформації від Користувачів на Веб-сайті Carely про їх
          можливий намір придбання Послуг у Партнера, що містить обрану Користувачем послугу,
          спеціаліста, кількість;
          <br />
          1.16. Згода користувача –  будь-яке добровільне, конкретне, поінформоване та однозначне
          волевиявлення Користувача, здійснене шляхом оформлення бронювання або проявом чітких
          ствердних дій (наприклад, шляхом натискання віртуальної кнопки «Підтвердити») для
          підтвердження згоди (дозволу) на опрацювання Адміністрацією/Партнерами своїх Даних та/або
          будь-якої іншої інформації, відповідно до сформульованої мети їх опрацювання.
          <br />
          1.17. Cookie –  фрагмент даних, згенерований Веб-сайтом і збережений на комп’ютері (у
          браузері) Користувача у вигляді одного або декількох файлів.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          2. ЗАГАЛЬНІ ПОЛОЖЕННЯ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          2.1. Веб-сайт Carely– це всеукраїнський інформаційний ресурс, що дозволяє Користувачеві
          отримувати дистанційно (через мережу Інтернет) доступ до систематизованих Інформаційних
          матеріалів Партнерів.
          <br /> 2.2. Послуги з доступу до Інформаційних матеріалів надаються Користувачеві
          відповідно до цієї Угоди користувача та на визначених Угодою умовах. Ця Угода не є
          публічною офертою договору купівлі-продажу.
          <br />
           2.3. Використовувати Веб-сайт дозволено лише особі, яка прийняла всі умови цієї Угоди та
          умови Угоди про захист персональних даних та конфіденційність інформації, поширеної на
          Веб-сайті за посиланням: https://carely.com.ua/privacyPolicy
          <br />
          2.4. Ця Угода є договором приєднання відповідно до положень статті 634 Цивільного кодексу
          України. ВИКОРИСТАННЯ КОРИСТУВАЧЕМ ВЕБ-САЙТУ В БУДЬ-ЯКИЙ СПОСІБ СВІДЧИТЬ ПРО ПРИЄДНАННЯ
          КОРИСТУВАЧА ДО ЦІЄЇ УГОДИ ПОВНІСТЮ ТА ПІДТВЕРДЖУЄ ФАКТ НАДАННЯ ЗГОДИ КОРИСТУВАЧА З
          НАВЕДЕНИМИ В ЦІЙ УГОДІ УМОВАМИ.
          <br /> 2.5. У випадку схвалення/приєднання до цієї Угоди (шляхом реєстрації відповідним
          Користувачем на Веб-сайті, внаслідок заповнення форм, надання особистого номеру мобільного
          телефону, шляхом реєстрації на Веб-сайті через свій профіль у соціальних мережах та ін.,
          шляхом натискання віртуальної кнопки «Підтвердити») Користувач підтверджує, що цілком і
          повністю ознайомлений і згоден з її умовами, а також, у випадку якщо Користувач є фізичною
          особою, що він дає дозвіл на опрацювання його Даних з метою та в порядку,
          передбаченими  умовами цієї Угоди.
          <br />
          2.6. КОРИСТУВАЧ ВИЗНАЄ, ЩО АДМІНІСТРАЦІЯ МОЖЕ ЧАС ВІД ЧАСУ ЗМІНЮВАТИ, МОДИФІКУВАТИ,
          ДОПОВНЮВАТИ АБО ВИДАЛЯТИ ЧИ ІНШИМ ЧИНОМ ОНОВЛЮВАТИ ЦЮ УГОДУ НА СВІЙ РОЗСУД БЕЗ ДОДАТКОВОГО
          ПОВІДОМЛЕННЯ ПРО ЦЕ КОРИСТУВАЧА.
          <br />
          2.7. Послуги, які надаються Адміністрацією та/або Партнерами, призначенні лише для
          Користувачів Веб-сайту на території України. Умови, визначені в цій Угоді, поширюються на
          всіх без винятку Користувачів Веб-сайту настільки, наскільки це визначено положеннями цієї
          Угоди.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          3. ПРЕДМЕТ УГОДИ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          3.1. Адміністрація надає послуги з доступу до Інформаційних матеріалів, поширених
          Адміністрацією та/або Партнерами на Веб-сайті, включно з його мобільними версіями,
          додатками та іншими програмами/програмними забезпеченнями  (далі –  Послуги
          Адміністрації).
          <br />
          3.2. Послуги Адміністрації, отримувані Користувачем за допомогою Веб-сайту, надаються лише
          в інформаційних цілях, якщо інше не буде передбачено цією Угодою та/або Угодою про захист
          персональних даних та конфіденційність інформації.
          <br />
          3.3. Адміністрація повідомляє, що Веб-сайт може містити посилання на інші веб-сайти або
          ресурси Партнерів. Адміністрація не несе відповідальності за такі веб-сайти та ресурси,
          зокрема, щодо їх доступності, законності, а також повноти та коректності поширених на них
          Інформаційних матеріалів.
          <br />
          3.4. Сторони розуміють та усвідомлюють, що (і) Веб-сайт/Адміністрація не є закладом
          охорони здоров’я, медичним центром чи їх мережею, (іі) Веб-сайт представляє собою
          інтернет-сервіс, спеціально створений для здійснення Користувачами пошуку Інформації про
          послуги, що реалізується безпосередньо Партнерами (зокрема, проте не виключно, закладами
          охорони здоров’я на території України) за його запитом. Адміністрація самостійно не надає
          послуги з бронювання Послуг та не здійснює господарську діяльність з реалізації Послуг
          тощо. Фактична угода про надання Послуг (їх купівля, оплата) укладається безпосередньо між
          Партнерами та Користувачами у приміщенні закладу охорони здоров’я. Партнери залишають за
          собою право встановлення/зміни власних умов доступу до інформації, послуг, умов продажу
          Послуг тощо.
          <br />
          3.5. Ця Угода не може вважатися електронним договором про надання Послуг (купівлю, оплату
          Послуг), не є електронним правочином між Користувачем та Партнером.
          <br /> 3.6. Адміністрація дозволяє Користувачеві отримувати Послуги лише для особистого
          некомерційного використання.
          <br />
          3.7. Користувач засвідчує, що він досяг 18-річного віку.
          <br />
          3.8. Користувач погоджується, що він буде використовувати лише один Обліковий запис
          користувача.
          <br />
          3.9. Користувач погоджується з тим, що створення Облікового запису користувача із
          використанням завідомо недостовірної інформації (включно зі створенням Облікових записів
          користувачів, зареєстрованих на інших осіб і осіб молодших 18 років) є порушенням умов
          цієї Угоди.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          4. ОБЛІКОВИЙ ЗАПИС КОРИСТУВАЧА
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          4.1. З метою отримання доступу до Веб-сайту, Користувач може створити свій Обліковий запис
          користувача.
          <br />
          4.2. Надані Користувачем дані повинні бути достовірними та  актуальними. Адміністрація має
          право запитати у Користувача додаткову інформацію для підтвердження Даних, зазначених ним
          під час  реєстрації на Веб-сайті.
          <br />
          4.3. Для реєстрації Облікового запису користувача, Користувач надає такі відомості: власне
          прізвище, та/або ім’я, та/або по-батькові, та/або адресу електронної пошти та/або номер
           персонального мобільного телефону, та/або реєструється через свій профіль у соціальних
          мережах. Користувач має вказати логін і пароль, які будуть пов’язані з його Обліковим
          записом користувача.
          <br />
          4.4. Якщо Користувач надасть Адміністрації недостовірну інформацію, або якщо Користувач
           неспроможний дотримуватися Угоди чи будь-яких інших додаткових умов, Адміністрація має
          право призупинити або видалити  його Обліковий запис користувача та припинити надання
          Послуг.
          <br />
          4.5. Користувач несе повну відповідальність за збереження власних Даних Облікового запису
          користувача (зокрема, логіна та пароля). У разі втрати Даних Облікового запису
          користувача, Користувач зобов’язується повідомити про це Адміністрацію.
          <br />
            4.6. Користувач повинен негайно повідомити Адміністрації про будь-яке порушення безпеки
          або несанкціоноване використання його Облікового запису користувача третіми  особами.
          Адміністрація не буде нести відповідальність за збитки, спричинені несанкціонованим
          використанням Облікового запису користувача третіми особами.
          <br />
          4.7. Якщо під час перевірки наданих Користувачем Даних виявлено надання недостовірних
          відомостей, Адміністрація відмовляє такому Користувачеві в підтвердженні Облікового запису
          користувача, а також залишає за собою право видалити Обліковий запис  користувача з
          Веб-сайту.
          <br />
          4.8. У випадку видалення Адміністрацією Облікового запису користувача з Веб-сайту з причин
          порушення Користувачем цієї Угоди та/або Угоди про захист персональних даних та
          конфіденційність інформації, розміщеної за посиланням https://carely.com.ua/privacyPolicy
          Адміністрація не зобов’язана надавати будь-які додаткові пояснення та/або роз’яснення
          Користувачеві. 
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          5. ПРАВА ТА ОБОВ’ЯЗКИ КОРИСТУВАЧІВ ТА АДМІНІСТРАЦІЇ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          5.1. Користувач та Адміністрація під час використання Веб-сайту зобов’язуються
          дотримуватись чинного законодавства України та наведених нижче правил.
          <br />
          5.2. Права Користувача:
          <br /> 5.2.1. Користувач має право в будь-який час заперечити проти Опрацювання його
          Даних. Адміністрація припинить обробку Даних після того, як заперечення буде подано у
          формі відповідної заяви. Опрацювання Даних Користувача буде припинено з моменту фактичного
          отримання заперечення Адміністрацією.
          <br />
          5.2.2. Користувач у будь-який час може відкликати Згоду користувача шляхом надсилання на
          ім’я Адміністрації відповідної заяви згідно з розділом 11 цього Договору. Заява з
          відкликанням Згоди користувача  набирає чинності з дати її фактичного отримання
          Адміністрацією.
          <br />
          5.2.3. Користувач має право вимагати від Адміністрації або самостійно негайно виправити
          будь-які Дані, що його стосуються, якщо ці Дані є недостовірними. З огляду на мету
          Опрацювання, Користувач має право доповнити свої Дані, зокрема шляхом подання відповідної
          заяви згідно з розділом 10 цього Договору.
          <br />
          5.2.4. Користувач має право на видалення його Даних. Адміністрація видаляє Дані за
          наявності хоча б однієї з таких підстав: (а) Дані більше не потрібні для цілей, для яких
          вони були зібрані або іншим чином Опрацьовані; (б) Користувач відкликає свою Згоду
          користувача; (в) Користувач подає заперечення проти Опрацювання його Даних; (г) Дані
          Опрацьовувалися незаконно; (д) Дані повинні бути видалені для виконання юридичного
          зобов’язання згідно з законодавством України.
          <br />
          5.2.5. Користувач має право на отримання своїх Даних, які він надав Адміністрації, в
          структурованому, загальноприйнятому форматі, та має право на передання таких Даних третім
          особам (зокрема, іншим володільцям та розпорядникам персональних даних) без перешкод з
          боку Адміністрації.
          <br />
          5.2.6. Користувач має право вимагати надання йому будь-якої інформації про його Дані,
          оброблені Адміністрацією. Користувач має право подати скаргу до компетентного державного
          органу.
          <br />
          5.3. Користувач зобов’язується:використовувати Веб-сайт виключно в межах тих прав і тими
          способами, які встановлені цією Угодою;здійснювати використання Облікового запису
          користувача на Веб-сайті особисто;надавати Адміністрації лише достовірні Дані та
          повідомляти Адміністрацію про їх зміну.
          <br />
          5.4. Користувачеві забороняється:вводити в оману чи здійснювати будь-які маніпуляції,
          спрямовані на уникнення обмежень, встановлених для доступу до Веб-сайту;вчиняти спроби
          обійти будь-які захисні технологічні перешкоди, пов’язані з використанням
          Веб-сайту;виконувати автоматизовані пошукові запити на Веб-сайті, які можуть завдати шкоди
          роботі Веб-сайту;використовувати інші девайси, програми, алгоритми, методології або
          будь-який аналогічний або еквівалентний ручний процес для отримання доступу, придбання,
          копіювання чи контролю над Веб-сайтом або контентом; відтворювати або обходити навігаційну
          структуру чи презентацію Веб-сайту, щоб отримувати або намагатися отримати будь-які
          матеріали, документи або інформацію будь-якими засобами та способами; намагатися отримати
          несанкціонований доступ до будь-якої частини або функції Веб-сайту, чи будь-яких інших
          систем або мереж, підключених до Веб-сайту або до будь-якого сервера Адміністрації, або до
          будь-якої з послуг, запропонованих на Веб-сайті, шляхом зламу або будь-якими іншими
          незаконними засобами; намагатися сканувати або тестувати вразливість Веб-сайту чи
          будь-якої мережі, підключеної до Веб-сайту; порушувати заходи безпеки та аутентифікації на
          Веб-сайті чи будь-якої мережі, підключеної до Веб-сайту; стежити або намагатися простежити
          за будь-якою інформацією про будь-якого іншого Користувача (зокрема, будь-який обліковий
          запис, який не належить цьому Користувачеві) з метою виявлення будь-яких Даних, окрім
          власних;вчиняти будь-які дії, які створюють надмірне або непропорційно велике навантаження
          на інфраструктуру Веб-сайту; використовувати будь-які пристрої, програмне забезпечення або
          процедури для втручання чи спроби втручання до повноцінної роботи Веб-сайту; надавати
          доступ до свого Облікового запису користувача третім особам; розміщувати інформацію та
          об’єкти, які можуть порушувати права та законні інтереси третіх осіб, а також інформацію,
          яка містить погрози, дискредитує, ображає, принижує честь і гідність чи ділову репутацію
          або порушує недоторканність приватного життя Користувачів, Адміністрації чи Партнерів; 
          використовувати Веб-сайт для інших цілей,  не передбачених цією Угодою.
          <br /> 5.5. Права та обов’язки Адміністрації:
          <br /> 5.5.1. Адміністрація має право: формувати статистичні дані; видаляти публікації
          Користувачів, які, на розсуд Адміністрації, не відповідають цій Угоді, чинному
          законодавству України та/або моральним чи етичним нормам; зупиняти та обмежувати доступ до
          Веб-сайту Користувачеві, який порушив умови використання Веб-сайту; встановлювати нові або
          вносити зміни до чинних умов користування Веб-сайтом без попередження Користувача;
          визначати наповнення Веб-сайту, інформацію, розміщену на Веб-сайті, вид та обсяг послуг,
          що надаються Користувачеві; використовувати Дані у спосіб, що не суперечить чинному
          законодавству України, з метою поліпшення роботи Веб-сайту;
          <br />
          5.5.2. Адміністрація зобов’язується:  вживати можливих організаційних та технічних заходів
          для захисту Даних від несанкціонованого і неправомірного або випадкового доступу до них,
          знищення,  перекручування, блокування, копіювання, поширення Даних із урахуванням положень
          цієї Угоди та Угоди про захист персональних даних та конфіденційність
          інформації;дотримуватися Угоди про захист персональних даних та конфіденційність
          інформації.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          6. ЗАХИСТ ДАНИХ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          6.1. Адміністрація та/або Партнери у процесі обробки Даних застосовують усі необхідні
          технічні, організаційні, правові заходи для захисту Даних від неправомірного та/або
          несанкціонованого доступу до таких Даних, зокрема, від змін, видалення, надання,
          розповсюдження, а також інших неправомірних дій.
          <br />
          6.2. Адміністрація та/або Партнери на постійній основі здійснюють контроль за прийнятими
          заходами щодо забезпечення безпеки Даних.
          <br /> 6.3. Користувач розуміє та погоджується з тим, що його Дані можуть оброблятися
          Партнером, а не лише Адміністрацією.
          <br /> 6.4. Відповідальність за розголошення Даних чи їх неналежне зберігання несе та
          сторона, яка вчинила такі дії без залучення до процесу іншої сторони.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          7. ВІДМОВА ВІД ГАРАНТІЙ ТА ВІДПОВІДАЛЬНІСТЬ СТОРІН
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          7.1. Адміністрація не гарантує, що Послуги відповідають особистим очікуванням та вимогам
          Користувачів та/або беззаперечно принесуть очікуваний Користувачами результат.
          Адміністрація не несе відповідальності перед Користувачами та третіми особами за можливі
          наслідки використання ними Веб-сайту.
          <br /> 7.2. Адміністрація не несе відповідальності за можливе зараження комп’ютерного
          обладнання або іншого майна Користувача вірусами, втрату даних внаслідок відвідування
          Користувачем Веб-сайту, користування Веб-сайтом та інформацією, завантажування
          Користувачем інформації.
          <br />
          7.3. Адміністрація не несе відповідальності за достовірність Інформаційних матеріалів,
          наданих Партнерами для розміщення за допомогою Веб-сайту, неможливість Партнера надати
          та/або продати (офлайн) заброньовану Послугу, неможливість Користувача оплатити
          заброньовану Послугу.
          <br />
          7.4. Адміністрація не гарантує та не несе відповідальності за будь-яку Послугу, яка
          рекламується або пропонується Користувачам Партнерами/третіми особами за допомогою
          Веб-сайту.
          <br />
          7.8. Адміністрація намагається забезпечити безпечність та надійність  Веб-сайту, але
          Адміністрація не може гарантувати безперервну роботу або доступ до Веб-сайту. Оновлення та
          інші функції можуть не відбуватися у реальному часі. Такі затримки не залежать від
          Адміністрації.
          <br />
          7.9. Користувач погоджується з тим, що він використовує Веб-сайт на свій ризик, і що
          Послуги надаються Користувачеві без жодних гарантій. Адміністрація не гарантує точності та
          повноти Інформаційних матеріалів, програм і послуг, що розміщені на Веб-сайті.
          Адміністрація та Партнери в будь-який час без повідомлення Користувача можуть вносити
          зміни в Інформаційні матеріали та Послуги, що надаються на Веб-сайті, а також у згадану в
          них Інформацію про послуги та цінові пропозиції. Якщо Інформаційні матеріали, поширені за
          допомогою Веб-сайту, застаріють, Адміністрація не зобов’язана оновлювати їх.
          <br />
          7.10. Користувачі проінформовані, що Адміністрація в будь-який час і без попереднього
          повідомлення залишає за собою право: змінити, призупинити або припинити роботу або доступ
          до Веб-сайту, або будь-якої частини Веб-сайту, з будь-якої причини; змінити Веб-сайт або
          будь-яку частину Веб-сайту, а також будь-які умови його використання; перервати роботу
          Веб-сайту або його частини на необхідний строк для виконання поточного чи позачергового
          обслуговування, виправлення помилок та інших змін.
          <br />
          7.11. Адміністрація не несе відповідальності за будь-які збитки (включно з втратою грошей,
          зв’язків або репутації, прибутку, інших нематеріальних втрат, будь-якими прямими або
          непрямими збитками) у результаті (прямо чи опосередковано): використання Користувачем чи
          Партнером Веб-сайту або неспроможності Користувача використовувати Веб-сайт; неточностей
          або помилок у Послугах Партнерів; затримок або збоїв у Послугах Партнерів; вірусів та
          іншого шкідливого програмного забезпечення; пошкодження пристроїв Користувача, внаслідок
          використання будь-яких послуг Веб-сайту тощо.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          8. РЕКЛАМА
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          8.1. Користувач розуміє, що Інформація про послуги та інформація про заклади охорони
          здоров’я (їх мережі), яка розміщена Адміністрацією та/або Партнерами, не є рекламою або
          рекламними матеріалами. Отримуючи Інформацію про послуги, Користувач набуває статусу
          споживача та надає згоду на отримання дистанційного доступу до Інформації про послуги.
          Відповідальним за зміст Інформації про послуги, яка розміщена на Веб-сайті є Партнер.
          <br />
          Інформаційні матеріали, поширені на Веб-сайті, визнаються рекламою, лише якщо вони
          ідентифіковані приміткою «Реклама» або «На правах реклами».
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          9. РОБОТА ВЕБ-САЙТУ CARELY. ІНФОРМАЦІЯ ПРО ПОСЛУГИ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          9.1. Користувач поінформований відповідно до цієї Угоди, що Послуги доступу до Інформації
          про послуги та інформації про заклади охорони здоров’я/їх мережу надаються Партнерами на
          підставі укладених договорів про надання послуг та/або про надання послуг обмеженого
          доступу до Веб-сайту та/або інших договорів, укладених між Адміністрацією та Партнерами.
          Відповідальність за інформацію, надану Партнерами для розміщення Інформаційних матеріалів
          за допомогою Веб-сайту в повному обсязі покладається на Партнерів.
          <br />  9.2. Партнери надають Адміністрації Інформацію про послуги для її подальшого
          розміщення на Веб-сайті. Партнери надають для поширення Інформацію про послуги, інформацію
          про заклад охорони здоров’я (мережу закладів охорони здоров’я), іншу інформацію на власний
          ризик та самостійно несуть відповідальність за свої дії/бездіяльність.
          <br /> 9.3. Користувач розуміє, що будь-які фотографічні зображення носять виключно
          демонстраційно-ілюстраційний характер та жодним чином не мають на меті інформування
          Користувача щодо послуг.
          <br />
          9.4. Користувач розуміє та погоджується з правилами роботи Веб-сайту. Опис Послуг
          міститься у текстовій частині екрану, поряд з фотографічним зображенням послуги та/або
          спеціаліста, яке розміщено виключно для прикладу або без такого фотографічного зображення.
          Після проходження кроку «знайти послугу», система пропонує перелік закладів, які
          пропонують послугу, що збігається за назвою з обраною Користувачем послугою. Після
          проходження кроку «забронювати» Користувач потрапляє до свого кошика, де знову бачить
          назву Послуги та має змогу обрати кількість Послуг. Перед тим, як перейти до остаточного
          кроку «оформити бронювання», Користувач уважно перевіряє назву, кількість послуги.
          Відповідальність за помилковий вибір необхідних послуг та будь-які негативні наслідки, що
          настануть у зв’язку із цим, Користувач несе самостійно та в повному обсязі.
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          10. РОЗІРВАННЯ УГОДИ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          10.1. Адміністрація  володіє правом у будь-який момент, в односторонньому порядку
          розірвати цю Угоду та/або припинити діяльність Веб-сайту. Адміністрація володіє правом в
          односторонньому порядку розірвати Угоду без настання будь-яких наслідків.
          <br />
          10.2. Користувач має право розірвати цю Угоду в будь-який момент шляхом самостійного
          видалення Облікового запису користувача з Веб-сайту. У випадку неможливості здійснення
          такого видалення Користувач може звернутися до Адміністрації з повідомленням про
          розірвання цієї Угоди на електронну адресу: carely.ua@gmail.com
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          11. КОНТАКТНА ІНФОРМАЦІЯ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          11.1. Якщо у Користувача є будь-які запитання або скарги щодо дотримання Адміністрацією
          або Партнерами умов цієї Угоди, або Користувач хоче надати будь-які рекомендації чи
          коментарі, він може направити листа електронною поштою на адресу: carely.ua@gmail.com
        </Typography>
        <Typography gutterBottom="xlg" component="h3">
          12. ДОЗВІЛ КОНТАКТУВАТИ З КОРИСТУВАЧЕМ
        </Typography>
        <Typography gutterBottom="xlg" component="p">
          12.1. Наданням Адміністрації та/або її Партнерам свою адресу електронної пошти/ номер
          телефону або інші Дані Користувач дає згоду на їх використання для відправки йому
          сервісних, юридичних, інформаційних та рекламних повідомлень. Користувач розуміє, що
          шляхом повідомлення Користувач може відмовитися від отримання інформаційних та рекламних
          повідомлень. Користувач погоджується отримувати дзвінки (зокрема, автоматично набрані
          та/або попередньо записані) від Адміністрації та/або Партнерів. Адміністрація та/або
          Партнери можуть телефонувати Користувачеві на будь-які телефонні номери (зокрема, мобільні
          телефонні номери), які Користувач надав Адміністрації та/або Партнеру. Якщо отриманий
          телефонний номер є номером мобільного телефону, Користувач надає згоду на отримання SMS,
          Viber-повідомлень або інших текстових повідомлень на цей номер.
        </Typography>
      </div>
    </>
  );
};

export default UserAgreement;
